providers/stripe/test/read/payment_intents/expand_customer.json

{
  "object": "list",
  "data": [
    {
      "id": "pi_3QjoLeES6gLOjP910d0QwpzI",
      "object": "payment_intent",
      "amount": 1000,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": 1737492418,
      "cancellation_reason": "failed_invoice",
      "capture_method": "automatic",
      "client_secret": "pi_3QjoLeES6gLOjP910d0QwpzI_secret_LVKWTE4cSgDZpoOcTeNYNe9m5",
      "confirmation_method": "automatic",
      "created": 1737492418,
      "currency": "usd",
      "customer": {
        "id": "cus_Rd3kcMGRvsoY8j",
        "object": "customer",
        "address": null,
        "balance": 0,
        "created": 1737489623,
        "currency": null,
        "default_source": null,
        "delinquent": false,
        "description": null,
        "discount": null,
        "email": "andrew.ross@example.com",
        "invoice_prefix": "16BC1FC5",
        "invoice_settings": {
          "custom_fields": null,
          "default_payment_method": null,
          "footer": null,
          "rendering_options": null
        },
        "livemode": false,
        "metadata": {},
        "name": "Andrew Ross",
        "next_invoice_sequence": 1,
        "phone": null,
        "preferred_locales": [],
        "shipping": null,
        "tax_exempt": "none",
        "test_clock": null
      },
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "latest_charge": null,
      "livemode": false,
      "metadata": {},
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_configuration_details": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        },
        "cashapp": {},
        "link": {
          "persistent_token": null
        }
      },
      "payment_method_types": [
        "card",
        "cashapp",
        "link"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": "off_session",
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "canceled",
      "transfer_data": null,
      "transfer_group": null
    }
  ],
  "has_more": true,
  "url": "/v1/payment_intents"
}
